#! /usr/bin/python3
# phoneAndEmail.py - Находит телефонные номера и адреса элетронной почты в буфере обмена.

import pyperclip, re

phoneRegex = re.compile(r'''(
    (\d{3}|\(\d{3}\))?
    (\s|-|\.)?
    (\d{3})
    (\s|-|\.)
    (\d{4})
    (\s*(ext|x|ext.)\s*(\d{2,5}))?
    )''', re.VERBOSE)

emailRegex = re.compile(r'''(
    [a-zA-Z0-9._%+-]+   # имя пользователя
    @
    [a-zA-Z0-9.-]+      # имя домена
    (\.[a-zA-Z]{2,4})   # остальная часть адреса
    )''', re.VERBOSE)

#TODO: найти соответствия в тексте, содержащемя в буфере обмена

#TODO: скопировать результаты в буфер обмена